Tekla Open API Reference for Tekla Structures 2025
LineSegment Constructor (Point, Point)
 Instantiates a line segment with the given points.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment(
	Point Point1,
	Point Point2
)
Public Sub New (
	Point1 As Point,
	Point2 As Point
)
Parameters
Point1
Type: Tekla.Structures.Geometry3d.Point
The starting point to be used.
Point2
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
See Also
Reference
LineSegment Class
LineSegment Overload
Tekla.Structures.Geometry3d Namespace